[M_MineAllMine MissionDefinition]
MissionName="Mine, All Mine"
TeaserText="If you've ever wanted to shoot someone who says stuff like ''tarnation,'' this is the mission for you."

[M_MineAllMine:KillwithSlag MissionObjectiveDefinition]
ProgressMessage="...with a slag weapon"

[M_MineAllMine:MiningEcho MissionObjectiveDefinition]
ProgressMessage="Grab Zeke's ECHO recorder"
